In [1]:
from io import StringIO

In [1]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv("Bollywood Movie List (1920-2024).csv")
df.head()

   Movie ID                                  Title  Year      Genre
0      3456         balika badhu a.k.a. baby bride  1920     social
1      3476                         vikram urvashi  1920  mythology
2      3474  sita swayamwar a.k.a. sita's marriage  1920  mythology
3      3473                        shri rama janma  1920  mythology
4      3472                     shri krishna leela  1920  mythology

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9443 entries, 0 to 9442
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Movie ID  9443 non-null   int64
 1   Title     9431 non-null   object
 2   Year      9443 non-null   int64
 3   Genre     7895 non-null   object
dtypes: int64(2), object(2)
memory usage: 295.2+ KB

In [7]:
df.head()

   Movie ID                                  Title  Year      Genre
0      3456         balika badhu a.k.a. baby bride  1920     social
1      3476                         vikram urvashi  1920  mythology
2      3474  sita swayamwar a.k.a. sita's marriage  1920  mythology
3      3473                        shri rama janma  1920  mythology
4      3472                     shri krishna leela  1920  mythology

In [8]:
type(df)

pandas.core.frame.DataFrame

In [17]:
data = ('col1,col2,col3,col4 \n'
        'x,y,z,1\n'
        'x,y,z,2\n'
        'x,y,z,3')

In [10]:
type(data)

str

In [12]:
StringIO(data)

In [13]:
type(data)

str

In [18]:
pd.read_csv(StringIO(data))

  col1 col2 col3  col4
0    x    y    z      1
1    x    y    z      2
2    x    y    z      3

In [32]:
import pandas as pd
from io import StringIO
second = ['a,b,c,d\n',
           '1,2,3,4\n',
           '4,5,6,7\n',
           '9,0,1,']

In [39]:
df1 = pd.read_csv(StringIO('second'))

In [40]:
df1

Empty DataFrame
Columns: [second]
Index: []